<?php

namespace App\Database\Seeds;

use CodeIgniter\Database\Seeder;

class PostSeeder extends Seeder
{
    public function slugify($text)
    {
        return mb_strtolower(preg_replace('/[\-\s]+/u', "-", trim(preg_replace('/[ ,.@#$%^&*()_\/=]+/', ' ', $text))));
    }

    public function run()
    {
        helper('text');
        $titles = [
            "জাতিসংঘের জীববৈচিত্র্য সম্মেলনে ইস্কন",
            "৪র্থ আন্তর্জাতিক সিম্পোজিয়াম ‘বিপ্লব- ২০২২’",
            "প্রভাবশালী উদ্যোক্তাদের ইসকনের বৈদিক গ্রাম",
            "ইতালির গোলোক ফার্মের অগ্রযাত্রা",
            "পরিবর্তনের বার্তা নিয়ে হাঙ্গেরি পদযাত্রা",
            "ভক্তিবেদান্ত ম্যানরে ব্রিটিশ লেবার পার্টির প্রধান",
            "১৭,০০০ ভক্তের অংশগ্রহণে পুরী পরিক্রমা",
            "নিউইয়র্ক রথযাত্রায় ভক্তের ঢল",
            "বাংলাদেশ চলচ্চিত্র ও প্রকাশনা অধিদপ্তর প্রকাশিত পত্র পত্রিকার তালিকায় হরেকৃষ্ণ সমাচার",
            "গৃহে বসে জন্মাষ্টমী মহোৎসব উদযাপন",
            "ভগবৎসেবায় দৃঢ়তা কেন প্রয়োজন?",
            "পুঠিয়ার রাজকন্যা শ্রীগঙ্গামাতা গোস্বামিনী",
            "ঐকান্তিক অন্বেষীদের দেবতারাও সাহায্য করে সন্তুষ্ট হন",
            "একাদশীর মাহাত্ম্য গ্রন্থ PDF ফ্রি ডাউনলোড",
            "মহাবেদী মহোৎসব- শ্রীজগন্নাথের মহিমান্বিত রথযাত্রা",
            "শ্রীল গৌরীদাস পণ্ডিতের প্রতি কৃপাপূর্বক শ্রীগৌর-নিত্যানন্দের শ্রীবিগ্রহ প্রকাশ",
            "শ্রীপাদ রামানুজাচার্যের সংক্ষিপ্ত জীবনী",
            "বিনম্র শরণাগতি - পুরুষোত্তম নিতাই দাস",
            "পানিহাটির চিড়াদধি মহোৎসব",
            "শ্রীমতী সীতাদেবীর অগ্নিপরীক্ষা",
            "দূর্ভাগ্য সহনের স্তর -শ্রীচৈতন্য চরণ দাস ব্রহ্মচারী",
            "শ্রীশ্রী গিরিরাজ গোবর্ধন পূজার ইতিহাস ও মাহাত্ম্য",
            "ভগবান শ্রীকৃষ্ণের অতি প্রিয় কার্তিক মাস",
            "রাজশাহীর বৈষ্ণব তীর্থ খেতুরী",
            "পরম পবিত্র কার্তিক মাস: ভক্তিলাভের অনন্য সুযোগ",
            "বৈষ্ণব জীবনে শ্রীনৃসিংহদেব",
            "শুদ্ধ ভক্তির লক্ষণ",
            "শুদ্ধ সাত্ত্বিক জীবন ও চারটি বিধি নিষেধ",
            "শ্রীকৃষ্ণপ্রেয়সী সত্যভামা :দামোদর মাস মাহাত্ম্য",
            "ভগবান শ্রীকৃষ্ণ অসুর সংহার করেন নাকি উদ্ধার করেন?",
            "শ্রীমদ্বাগবতে বর্ণিত দ্বাদশ মহাজন",
            "রথযাত্রা মহোৎসব;এক অজানা ইতিহাস",
            "রথযাত্রার অপ্রাকৃত মহিমা -বিষ্ণুখণ্ড, পুরুষোত্তম মাহাত্ম্য",
            "পণতীর্থ ধামে মাহাত্ম্য ও মহাবারুণি স্নান",
            "বৈষ্ণব সঙ্গলাভের উপকার -শ্রীল জয়পতাকা স্বামী মহারাজ",
            "ইসকন প্রতিষ্ঠার সাতটি প্রধান উদ্দেশ্য",
            "অক্ষয় তৃতীয়া ও চন্দনযাত্রা মাহাত্ম্য",
            "কৃষ্ণভাবনামৃতের অর্থ কী -শ্রীল এ সি ভক্তিবেদান্ত স্বামী প্রভুপাদ",
        ];
        $tags = ['আন্তর্জাতিক', 'অগ্রযাত্রা', 'জীবনী', 'ইসকন', 'প্রভুপাদ', 'চন্দনযাত্রা', 'অক্ষয়-তৃতীয়া', 'পরিবর্তন', 'যুগধর্ম', 'মহোৎসব', 'রথযাত্রা', 'পদযাত্রা', 'বৈদিক গ্রাম', 'শ্রীমদ্বাগবত', 'মাহাত্ম্য', 'রামানুজাচার্য', 'লীলা-স্মরণ', 'রাগানুগাভক্তি', 'সাধনভক্তি'];



        function make_body($num)
        {
            $body = '<p><strong>আমরা তপস্যা করবার যোগ্য নই।</strong> এমনকি এ কলিযুগে অষ্টকালীয় লীলা-স্মরণ করবারও যোগ্য নই। বাস্তবে এটি আমাদের ধারণারও বাইরে। দম্ভবশত আমরা জল্পনা-কল্পনা করতে পারি, কিন্তু শ্রীল বিশ্বনাথ চক্রবর্তী ঠাকুর &lsquo;রাগবর্ত্ম-চন্দ্রিকা&rsquo;য় বলেছেন,</p>
    <blockquote><span style="color:red;"><strong>&ldquo;</strong></span>এমনকি রাগানুগা-সাধনভক্তির অন্যতম অঙ্গ &lsquo;স্মরণ&rsquo; শ্রীকৃষ্ণ-নাম-সঙ্কীর্তন (সংকীর্তন মানে হলো সমবেতভাবে কীর্তন) ব্যতিরেকে অসম্ভব।<span style="color:red;"><strong>&rdquo;</strong></span></blockquote>
    <p>কলিযুগের যুগধর্ম হরিনাম-সঙ্কীর্তনের সাথে সমন্বয় সাধন ছাড়া ভক্তিযোগের কোনো অঙ্গই সাধন করা সম্ভব নয়। এজন্যই আচার্যগণ বারবার হরিনাম সংকীর্তন করার ওপর জোর দিয়েছেন।</p>
    <p><strong><span style="color:#ff00fe">দৈন্যতা</span></strong> মানে হলো এটি উপলব্ধি করা যে, এই কলিযুগে আমরা কোনো কিছুর যোগ্য নই। আমরা কর্মযোগের যোগ্য নই, জ্ঞান, অষ্টাঙ্গযোগ, ধ্যান করার যোগ্য নই। আমরা প্রচুর পরিমাণ ঘি দিয়ে বড় বড় যজ্ঞ করার, ঐশ্বর্যপূর্ণ শ্রীবিগ্রহ অর্চন করার যোগ্য নই।</p>';
            $text = '';
            for ($i = 1; $i < $num; $i++) {
                $ending = $i === 1 || $i === $num ? '' : '<br/>';
                $text .= $body . $ending;
            }
            return $text;
        }
        // foreach ($titles as  $index => $title) {
        for ($index = 0; $index < 12000; $index++) {
            $shuffled_tags = $tags;
            $title = $titles[array_rand($titles, 1)];
            shuffle($shuffled_tags);
            $post = [
                'title' => $title,
                'slug' => $this->slugify($title) . '_' . random_string(),
                'body' => make_body(rand(1, 4)),
                'user_id' => rand(1, 5),
                'media_id' => rand(1, 16),
                'category_id' => rand(1, 10),
                'tags' => implode(',', array_splice($shuffled_tags, 0, rand(3, 5)))
            ];
            $this->db->table('posts')->insert($post);
        }
    }
}
